thanhtra3105/UAV_Air_Quality_Monitor/fc_stm32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 *
 * ======Body frame of DRONE========
 *
 *           +X (Front)
 ↑
 │
 -Y (Left) ◄──┼──► +Y (Right)
 │
 ▼
 Rear
 *
 *===== AXis of Optical Flow====
 *          Front
 ↑
 │
 Vy <0 │
 │
 Left ◄──────┼──────► Right
 Vx <0  │        Vx >0
 │
 Vy >0 │
 ▼
 Rear
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "nrf.h"
#include "icm20602.h"
#include "qmc5883.h"
#include "kalman.h"
#include "dwt.h"
#include "pid_controller.h"
#include "types.h"
#include <stdbool.h>
#include "uart_cmd.h"
#include "mtf01.h"
#include "tof.h"
#include "gps.h"
#include "pos_hold.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;

SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim6;

UART_HandleTypeDef huart4;
UART_HandleTypeDef huart7;
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_TIM3_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C2_Init(void);
static void MX_SPI1_Init(void);
static void MX_UART4_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_ICACHE_Init(void);
static void MX_UART7_Init(void);
static void MX_SPI2_Init(void);
static void MX_TIM6_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
#define RAD_TO_DEG 57.2958f
#define DEG_TO_RAD 0.017453f

uint8_t address[5] = { '0', '0', '0', '0', '1' };

/* THÊM ĐOẠN NÀY LÊN PHÍA TRÊN MAIN HOẶC VÀO USER CODE BEGIN */
#pragma pack(push, 1)
struct ControlData {
	uint16_t trucX;
	uint16_t trucY;
	uint8_t trai;
	uint8_t phai;
	uint8_t len;
	uint8_t xuong;
	uint8_t batquathut;
	uint8_t nut1;
	uint8_t nut2;
	uint8_t chinhtocdoquat;
	uint8_t has_wp;
	int32_t wp_lat;
	int32_t wp_lon;
};
#pragma pack(pop)

struct ControlData rxData;
QMC5883_t mag;
ICM20602_t imu;
GPS_Data_t gps;
Kalman2D_t kf;
MTF01_t mtf_data;
KalmanAxis_t kf_x;
KalmanAxis_t kf_y;

float dt;
float gx, gy, gz;
float ax, ay, az;
float ax_offset = 0.0;
float ay_offset = 0.0;
float az_offset = 0.0;
float gx_offset = 0.0;
float gy_offset = 0.0;
float gz_offset = 0.0;

// ===== PID Parameters =====
PIDController_t PID_Angle;
PIDController_t PID_Rate_Pitch;
PIDController_t PID_Rate_Roll;
PIDController_t PID_Rate_Yaw;
PIDController_t PID_Alt;
PIDController_t PID_Alt_Pos;   // outer: vị trí -> target velocity
PIDController_t PID_Alt_Vel;   // inner: velocity -> throttle offset

// ===== PID ANGLE =====
float kp_angle = 6.5, ki_angle = 0, kd_angle = 0;
// ===== PID RATE =====
float kp_r = 0.85, ki_r = 0.000, kd_r = 0.003;
float kp_p = 0.85, ki_p = 0.000, kd_p = 0.003;
float kp_y = 0.85, ki_y = 0.000, kd_y = 0.003;
// ===== PID ALTITUDE ====
float kp_alt_pos = 4.0, ki_alt_pos = 0.0f, kd_alt_pos = 0.0f;
float kp_alt_vel = 0.8, ki_alt_vel = 0.0f, kd_alt_vel = 0.003f;
// ===== PID POSITION HOLD ====
float kp_xy_pos = 1.2f, ki_xy_pos = 0.0f, kd_xy_pos = 0.0f; // Chậm rãi, mượt mà tính ra vận tốc
float kp_xy_vel = 6.0f, ki_xy_vel = 0.1f, kd_xy_vel = 0.05f; // Nghiêng dứt khoát để đạt được vận tốc đó

// ===== TARGET ROLL/PITCH MAX/MIN =======
const float MAX_TARGET_ROLL_PITCH = 6.0;

// ================= MOTOR =================
int throttle = 1000;
int throttle_hover = 1000;

// ================= ANGLE =================
float roll = 0;
float pitch = 0;
float yaw = 0;

// ================= TARGET ANGLE =================
float target_pitch = 0; // độ (angle mode)
float target_roll = 0;
float target_yaw = 0;
// ================= TARGET RATE =================
float target_rate_pitch = 0;              // deg/s
float target_rate_roll = 0;
float target_rate_yaw = 0;

// ============= ALTITUDE=======================
float kp_alt = 3.0, ki_alt = 0.0, kd_alt = 0.5;
float target_alt;
float pid_alt = 0;
float target_vz = 0.0f;
uint8_t mtf01_updated = 0;	// flag mtf updated
const float MAX_TARGET_VZ = 80.0f;
const float MAX_ALT_OUTPUT = 200.0f;

// ================= OUTPUT PID =================
float pid_p, pid_r, pid_y;
float pid_alt_vel_out = 0.0f;

float yaw_filt = 0;

/*========SAFE CONNECTED========*/
uint32_t timeout_connected = 0;
uint32_t time_throttle = 0;

uint8_t pid_flag = 0;
int distance = 0;
float vx = 0;
float vy = 0;
float current_alt;
uint8_t alt_hold = 0;
uint8_t alt_init = 0;

extern char gps_buffer[100];
extern volatile uint8_t gps_ready;
extern uint8_t rx_byte;

float time_dt = 0;

char raw_gps_buffer[120];
uint16_t raw_index = 0;
volatile uint8_t line_ready = 0;

//==== EST POSITION=====
#define FLOW_ALPHA     0.2f
#define KP_FLOW        0.25f
#define KI_FLOW        0.02f
#define KP_POS         0.10f

