thanhtra3105/UAV_Air_Quality_Monitor/fc_stm32/Core/Src/main.c
float ax_earth = 0.0f;
float ay_earth = 0.0f;

float ax_bias = 0.0f;
float ay_bias = 0.0f;

// Vận tốc ước lượng (Earth Frame)
float est_vx = 0.0f;
float est_vy = 0.0f;

// Vị trí ước lượng (Earth Frame) - m
float est_x = 0.0f;
float est_y = 0.0f;

// Thêm vào vùng khai báo biến toàn cục
PIDController_t PID_Pos_X;
PIDController_t PID_Pos_Y;
PIDController_t PID_Vel_X;
PIDController_t PID_Vel_Y;

// Điểm neo (Target)
#define MAX_TARGET_VEL_XY 1.0f  // m/s, tùy kích thước/độ nhạy drone của bạn
float target_x = 0.0f;
float target_y = 0.0f;

float target_vx = 0.0f;
float target_vy = 0.0f;

uint8_t pos_hold_active = 0; // Cờ trạng thái

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
	if (huart->Instance == USART1) {
		UART_CMD_Process(&huart1);
	}

	if (huart->Instance == USART2) {
//		MTF01_UARTCallback(&mtf01_handle);
		MTF01_Process(&huart2);
	}

//	GPS_UART_RxCallback(&huart1);
//	if (huart->Instance == USART1) {
//		// CHÌA KHÓA Ở ĐÂY: Chỉ cho phép lưu data khi mảng đang rảnh (line_ready == 0)
//		if (line_ready == 0) {
//			raw_gps_buffer[raw_index++] = rx_byte;
//
//			// Nếu gặp ký tự xuống dòng hoặc mảng sắp tràn
//			if (rx_byte == '\n' || raw_index >= 119) {
//				raw_gps_buffer[raw_index] = '\0'; // Chốt chuỗi
//				line_ready = 1;             // Khóa mảng lại, báo cho main xử lý
//			}
//		}
//
//		// Vẫn phải mồi lại ngắt (dù có lưu vào mảng hay không) để tránh ORE
//		HAL_UART_Receive_IT(&huart1, &rx_byte, 1);
//	}
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
	if (htim->Instance == TIM6) {
		pid_flag = 1;
	}

}

long map(long x, long in_min, long in_max, long out_min, long out_max) {
	return (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
}

float constrain(float data, float min, float max) {
	if (data <= min)
		return min;
	if (data >= max)
		return max;
	return data;
}
void writeMotor(uint8_t chanel, int16_t us) {
	__HAL_TIM_SET_COMPARE(&htim3, chanel, us);
}

void Failsafe_Task(void) {
	if (HAL_GetTick() - timeout_connected > 1000) {
		alt_hold = false;

		if (HAL_GetTick() - time_throttle > 400) {
			if (throttle > 1200) {
				throttle -= 10;
				time_throttle = HAL_GetTick();
			} else {
				if (mtf_data.distance < 200)	// <20cm
					throttle = 1000;
			}
		}
	}
}

void RxController() {
	if (NRF24_Available()) {
		uint8_t len = NRF24_GetDynamicPayloadSize();

		if (len == sizeof(struct ControlData)) {
			NRF24_Read((uint8_t*) &rxData, len);
			throttle = map((long) rxData.chinhtocdoquat, 0, 100, 1000, 1800);
			target_roll = (float) map(rxData.trucX, 0, 1023,
					(long) MAX_TARGET_ROLL_PITCH,
					(long) -MAX_TARGET_ROLL_PITCH);
			target_pitch = (float) map(rxData.trucY, 0, 1023,
					(long) MAX_TARGET_ROLL_PITCH,
					(long) -MAX_TARGET_ROLL_PITCH);
			alt_hold = rxData.nut1;
			timeout_connected = HAL_GetTick();
		}
	} else {
		Failsafe_Task();
	}
}

void readIMU() {
	ICM20602_Read(&imu);
	gx = (imu.gyro.x - gx_offset);
	gy = (imu.gyro.y - gy_offset);
	gz = -(imu.gyro.z - gz_offset);

	ax = imu.accel.x - ax_offset;
	ay = imu.accel.y - ay_offset;
	az = imu.accel.z - (az_offset - 1);
}

// Các thông số nhiễu đo lường (Measurement Noise) - Bạn cần tinh chỉnh thực tế
#define OPTICAL_FLOW_R 0.5f // Phương sai nhiễu đo vận tốc của Optical flow

void Estimate_Position_Kalman(float dt) {
	/*=============================
	 1. Rotation Body -> Earth (Giữ nguyên của bạn)
	 =============================*/
	float cy = cosf(yaw * DEG_TO_RAD);
	float sy = sinf(yaw * DEG_TO_RAD);
	float cp = cosf(pitch * DEG_TO_RAD);
	float sp = sinf(pitch * DEG_TO_RAD);
	float cr = cosf(roll * DEG_TO_RAD);
	float sr = sinf(roll * DEG_TO_RAD);

	float ax_earth = cy * cp * ax + (cy * sp * sr - sy * cr) * ay
			+ (cy * sp * cr + sy * sr) * az;

	float ay_earth = sy * cp * ax + (sy * sp * sr + cy * cr) * ay
			+ (sy * sp * cr - cy * sr) * az;

	ax_earth *= 9.81f;
	ay_earth *= 9.81f;

	/*=============================
	 2. Optical Flow -> Earth (Giữ nguyên của bạn)
	 =============================*/
	float body_vx = -mtf_data.vy; // Tiến/Lùi
	float body_vy = mtf_data.vx;  // Trái/Phải

	float flow_vx = body_vx * cy - body_vy * sy;
	float flow_vy = body_vx * sy + body_vy * cy;

	// (Tuỳ chọn: bạn có thể vẫn giữ Low Pass Filter cho flow_vx, flow_vy nếu nhiễu quá mạnh,
	// nhưng bản chất KF đã lo việc lọc nhiễu, bạn có thể truyền thẳng flow vào Update)

	/*=============================
	 3. Kalman PREDICT (Dựa vào IMU)
	 =============================*/
	// LƯU Ý: Nếu dùng KF 2-state, bạn nên trừ bias thủ công trước khi đưa vào Predict
	// nếu bạn vẫn muốn giữ cơ chế trừ bias cũ.
	float ax_input = ax_earth - ax_bias;
	float ay_input = ay_earth - ay_bias;

	KalmanAxis_Predict(&kf_x, ax_input, dt);
	KalmanAxis_Predict(&kf_y, ay_input, dt);

	/*=============================
	 4. Kalman UPDATE (Dựa vào Optical Flow)
	 =============================*/
	if (mtf_data.flow_quality > 50 && mtf_data.distance >= 100) {
		// Cập nhật KF bằng vận tốc đo được từ Flow
		KalmanAxis_UpdateVel(&kf_x, flow_vx, OPTICAL_FLOW_R);
		KalmanAxis_UpdateVel(&kf_y, flow_vy, OPTICAL_FLOW_R);

		// Cập nhật Bias theo kiểu cũ (Do KF 2 trạng thái không tự ước lượng bias)
		float err_vx = flow_vx - kf_x.vel;
		float err_vy = flow_vy - kf_y.vel;
		ax_bias += KI_FLOW * err_vx * dt;
		ay_bias += KI_FLOW * err_vy * dt;
	}

	/*=============================
	 5. Cập nhật biến State cho hàm Position Hold
	 =============================*/
	est_x = kf_x.pos;
	est_vx = kf_x.vel;

	est_y = kf_y.pos;
	est_vy = kf_y.vel;
}

float readHeading(float roll_deg, float pitch_deg) {
	QMC5883_Read(&hi2c2, &mag);

	float roll_rad = roll_deg * DEG_TO_RAD;
	float pitch_rad = pitch_deg * DEG_TO_RAD;

	float cr = cosf(roll_rad);
	float sr = sinf(roll_rad);
	float cp = cosf(pitch_rad);
	float sp = sinf(pitch_rad);

	// Tilt Compensation
	float mx = mag.x * cp + mag.z * sp;
	float my = mag.x * sr * sp + mag.y * cr - mag.z * sr * cp;

	float heading = atan2f(my, mx) * RAD_TO_DEG;

	// Chuẩn hóa về [-180,180]
	if (heading > 180.0f)
		heading -= 360.0f;
	if (heading < -180.0f)
		heading += 360.0f;

	return heading;
}

void calculateAngle(float dt) {

	float roll_acc = atan2(ay, sqrt(ax * ax + az * az)) * 57.2958;
	float pitch_acc = atan2(-ax, sqrt(ay * ay + az * az)) * 57.2958;
//  ================= KALMAN FILTER =================
	Kalman1D_Compute(roll, KalmanUncertaintyAngleRoll, gx, roll_acc, dt);
	roll = Kalman1DOutput[0];
	KalmanUncertaintyAngleRoll = Kalman1DOutput[1];

	Kalman1D_Compute(pitch, KalmanUncertaintyAnglePitch, gy, pitch_acc, dt);
	pitch = Kalman1DOutput[0];
	KalmanUncertaintyAnglePitch = Kalman1DOutput[1];

	//---------------- Yaw ----------------- //

	// 1. Predict bằng gyro
	yaw += gz * dt;
	if (yaw > 180.0f)
		yaw -= 360.0f;
	if (yaw < -180.0f)
		yaw += 360.0f;
	// 2. Heading từ la bàn
	float heading = readHeading(roll, pitch);
	static float heading_lpf = 0.0f;

	heading_lpf += 0.1f * (heading - heading_lpf);
	// 3. Sai số nhỏ nhất
	float err = heading_lpf - yaw;
	if (err > 180.0f)
		err -= 360.0f;

	if (err < -180.0f)
		err += 360.0f;
	// 4. Complementary Filter
	const float alpha = 0.01f;      // 0.01~0.05
	yaw += alpha * err;
	if (yaw > 180.0f)
		yaw -= 360.0f;
	if (yaw < -180.0f)
		yaw += 360.0f;

	/* ============ALTITUDE HOLD===========*/
	float acc_z_inertial = -sin(pitch * DEG_TO_RAD) * ax
			+ cos(pitch * DEG_TO_RAD) * sin(roll * DEG_TO_RAD) * ay
			+ cos(pitch * DEG_TO_RAD) * cos(roll * DEG_TO_RAD) * az;
	acc_z_inertial = (acc_z_inertial - 1) * 981.0f;  // cm/s2
// ===== LPF cho acc_z_inertial =====
	static float acc_z_filt = 0.0f;
	static bool acc_z_filt_init = false;
	const float LPF_ALPHA = 0.2f;   // 0..1, càng nhỏ càng mượt nhưng càng trễ

	if (!acc_z_filt_init) {
		acc_z_filt = acc_z_inertial; // tránh trễ khởi động (transient) lúc mới bật
		acc_z_filt_init = true;
	} else {
		acc_z_filt = LPF_ALPHA * acc_z_inertial
				+ (1.0f - LPF_ALPHA) * acc_z_filt;
	}
	static float tof_cm = 0;
	if (mtf01_updated) {
		tof_cm = mtf_data.distance * 0.1f;
		tof_cm = tof_cm * cosf(roll * DEG_TO_RAD) * cosf(pitch * DEG_TO_RAD);
		current_alt = tof_cm;
		Kalman2D_Update(&kf, current_alt, 1.0f);
		mtf01_updated = 0; // update done
	}

