thanhtra3105/UAV_Air_Quality_Monitor/fc_stm32/Core/Src/main.c
}

void Estimate_Position(float dt) {
	/*=============================
	 Rotation Body -> Earth
	 =============================*/
	float cy = cosf(yaw * DEG_TO_RAD);
	float sy = sinf(yaw * DEG_TO_RAD);
//	float cy = 1.0f;
//	float sy = 0.0f;
	float cp = cosf(pitch * DEG_TO_RAD);
	float sp = sinf(pitch * DEG_TO_RAD);
	float cr = cosf(roll * DEG_TO_RAD);
	float sr = sinf(roll * DEG_TO_RAD);

	ax_earth = cy * cp * ax + (cy * sp * sr - sy * cr) * ay
			+ (cy * sp * cr + sy * sr) * az;

	ay_earth = sy * cp * ax + (sy * sp * sr + cy * cr) * ay
			+ (sy * sp * cr - cy * sr) * az;

	ax_earth *= 9.81f;
	ay_earth *= 9.81f;

	/*=============================
	 Optical Flow -> Earth
	 =============================*/
	float body_vx = -mtf_data.vy; // Tiến/Lùi
	float body_vy = mtf_data.vx;  // Trái/Phải

	float flow_vx = body_vx * cy - body_vy * sy;
	float flow_vy = body_vx * sy + body_vy * cy;

	/*=============================
	 Low Pass Filter cho Flow
	 =============================*/
	static float flow_vx_lp = 0.0f;
	static float flow_vy_lp = 0.0f;

	flow_vx_lp += FLOW_ALPHA * (flow_vx - flow_vx_lp);
	flow_vy_lp += FLOW_ALPHA * (flow_vy - flow_vy_lp);

	/*=============================
	 Prediction (IMU)
	 =============================*/
	float ax_correct = ax_earth - ax_bias;
	float ay_correct = ay_earth - ay_bias;

	est_vx += ax_correct * dt;
	est_vy += ay_correct * dt;

	/*=============================
	 Correction (Optical Flow)
	 =============================*/
	// Cần > 100mm (10cm) để tránh Ground Effect
	if (mtf_data.flow_quality > 50 && mtf_data.distance >= 100) {
		float err_vx = flow_vx_lp - est_vx;
		float err_vy = flow_vy_lp - est_vy;

		ax_bias += KI_FLOW * err_vx * dt;
		ay_bias += KI_FLOW * err_vy * dt;

		est_vx += KP_FLOW * err_vx;
		est_vy += KP_FLOW * err_vy;
	}

	/*=============================
	 Integrate Position
	 =============================*/
	est_x += est_vx * dt;
	est_y += est_vy * dt;
}

void positionHold(float dt) {
	uint8_t pos_hold_sw = rxData.nut2;

	if (pos_hold_sw && alt_hold) {
		if (!pos_hold_active) {
			target_x = est_x;
			target_y = est_y;
			PID_Reset(&PID_Pos_X);
			PID_Reset(&PID_Pos_Y);
			PID_Reset(&PID_Vel_X);
			PID_Reset(&PID_Vel_Y);
			pos_hold_active = 1;
		}
		// ====== POSITION LOOP=====
		float err_x = target_x - est_x;
		float err_y = target_y - est_y;
		target_vx = PID_Calculate(&PID_Pos_X, err_x, dt);
		target_vy = PID_Calculate(&PID_Pos_Y, err_y, dt);

		target_vx = constrain(target_vx, -MAX_TARGET_VEL_XY, MAX_TARGET_VEL_XY);
		target_vy = constrain(target_vy, -MAX_TARGET_VEL_XY, MAX_TARGET_VEL_XY);
		// ==== VELOCITY X,Y LOOP=====
		float err_vx = target_vx - est_vx;
		float err_vy = target_vy - est_vy;

		// Góc nghiêng cần thiết trên hệ tọa độ Trái Đất
		float out_angle_earth_x = PID_Calculate(&PID_Vel_X, err_vx, dt);
		float out_angle_earth_y = PID_Calculate(&PID_Vel_Y, err_vy, dt);

		// VÒNG 3: ROTATION
		float cy = cosf(yaw * DEG_TO_RAD);
		float sy = sinf(yaw * DEG_TO_RAD);
		float target_pitch_body = out_angle_earth_x * cy
				+ out_angle_earth_y * sy;
		float target_roll_body = -out_angle_earth_x * sy
				+ out_angle_earth_y * cy;
		// Giới hạn góc nghiêng tối đa khi giữ vị trí (VD: 15 độ)
		target_pitch_body = constrain(target_pitch_body, -15.0f, 15.0f);
		target_roll_body = constrain(target_roll_body, -15.0f, 15.0f);

		target_pitch = target_pitch_body; // Âm ngóc, dương chúi (Tùy cấu hình hàm cân bằng của bạn)
		target_roll = target_roll_body;
	} else {
		// Tắt Pos Hold
		if (pos_hold_active) {
			pos_hold_active = 0;
			// Trả lại target_pitch và target_roll cho tay cầm (RC)
		}
	}
}

void calculatePIDAngle(float dt_angle) {
	/* ============ALTITUDE HOLD - CASCADE===========*/
	if (alt_hold && !alt_init) {
		alt_init = true;
		target_alt = kf.altitude;      // chốt độ cao hiện tại làm setpoint
		PID_Reset(&PID_Alt_Pos);
		PID_Reset(&PID_Alt_Vel);
	}

	if (alt_hold) {
		float alt_err = target_alt - kf.altitude;
		target_vz = PID_Calculate(&PID_Alt_Pos, alt_err, dt_angle);
		target_vz = constrain(target_vz, -MAX_TARGET_VZ, MAX_TARGET_VZ);
	} else {
		alt_init = false;
		target_vz = 0;
		PID_Reset(&PID_Alt_Pos);
	}

	//	========== OPTICAL FLOW MTF01 POS HOLD =============
	positionHold(dt_angle);

	//  ================= PID ANGLE =================
	float pitch_err = target_pitch - pitch;
	target_rate_pitch = PID_Calculate(&PID_Angle, pitch_err, dt_angle);

	float roll_err = target_roll - roll;
	target_rate_roll = PID_Calculate(&PID_Angle, roll_err, dt_angle);

	float yaw_err = target_yaw - yaw;
	if (yaw_err > 180)
		yaw_err -= 360;
	if (yaw_err < -180)
		yaw_err += 360;
	target_rate_yaw = PID_Calculate(&PID_Angle, yaw_err, dt_angle);

	/* ======= CONSTRAINT =========*/
	target_rate_pitch = constrain(target_rate_pitch, -200, 200);
	target_rate_roll = constrain(target_rate_roll, -200, 200);
	target_rate_yaw = constrain(target_rate_yaw, -200, 200);
}

void calcualatePIDRate(float dt_rate) {
//  ================= PID RATE =================
	float pitch_rate_err = target_rate_pitch - gy;
	pid_p = PID_Calculate(&PID_Rate_Pitch, pitch_rate_err, dt_rate);

	float roll_rate_err = target_rate_roll - gx;
	pid_r = PID_Calculate(&PID_Rate_Roll, roll_rate_err, dt_rate);

	float yaw_rate_err = target_rate_yaw - gz;
	pid_y = PID_Calculate(&PID_Rate_Yaw, yaw_rate_err, dt_rate);

	/* ============ALTITUDE HOLD - INNER (Velocity, 500Hz) ===========*/
	float acc_z_inertial = -sin(pitch * DEG_TO_RAD) * ax
			+ cos(pitch * DEG_TO_RAD) * sin(roll * DEG_TO_RAD) * ay
			+ cos(pitch * DEG_TO_RAD) * cos(roll * DEG_TO_RAD) * az;
	acc_z_inertial = (acc_z_inertial - 1) * 981.0f;

	static float acc_z_filt = 0.0f;
	static bool acc_z_filt_init = false;
	const float LPF_ALPHA = 0.2f;
	if (!acc_z_filt_init) {
		acc_z_filt = acc_z_inertial;
		acc_z_filt_init = true;
	} else {
		acc_z_filt = LPF_ALPHA * acc_z_inertial
				+ (1.0f - LPF_ALPHA) * acc_z_filt;
	}

	Kalman2D_Predict(&kf, acc_z_filt, dt_rate); // <-- dùng dt_rate (2ms), không phải dt_angle

	if (alt_hold) {
		float vz_err = target_vz - kf.velocity;
		pid_alt_vel_out = PID_Calculate(&PID_Alt_Vel, vz_err, dt_rate);
		pid_alt = pid_alt_vel_out;
	} else {
		pid_alt = 0;
		PID_Reset(&PID_Alt_Vel);
	}

