thanhtra3105/UAV_Air_Quality_Monitor/fc_stm32/Core/Src/main.c
	pid_r = constrain(pid_r, -300, 300);
	pid_p = constrain(pid_p, -300, 300);
	pid_y = constrain(pid_y, -300, 300);
	pid_alt = constrain(pid_alt, -MAX_ALT_OUTPUT, MAX_ALT_OUTPUT);
}

void mixer() {
	int m1 = (int) (float) throttle - pid_p - pid_r - pid_y + pid_alt;
	int m2 = (int) (float) throttle + pid_p - pid_r + pid_y + pid_alt;
	int m3 = (int) (float) throttle + pid_p + pid_r - pid_y + pid_alt;
	int m4 = (int) (float) throttle - pid_p + pid_r + pid_y + pid_alt;

//	int m1 = (int) (float) throttle - pid_p;
//	int m2 = (int) (float) throttle + pid_p;
//	int m3 = (int) (float) throttle + pid_p;
//	int m4 = (int) (float) throttle - pid_p;

	if (throttle > 1040) {
		writeMotor(M1, m1);
		writeMotor(M2, m2);
		writeMotor(M3, m3);
		writeMotor(M4, m4);
	} else {
		writeMotor(M1, 1000);
		writeMotor(M2, 1000);
		writeMotor(M3, 1000);
		writeMotor(M4, 1000);
	}
}

static uint8_t angle_div = 0;

void PID_Task(float dt_pid) {
	if (++angle_div >= 2) {
		angle_div = 0;
		calculatePIDAngle(dt_pid * 2);      // 250 Hz
//		distance = readTOF(&hi2c1);
	}
	calcualatePIDRate(dt_pid);          // 500 Hz
}

void calibIMU() {
//	for (int i = 0; i < 500; i++) {
//		ICM20602_Read(&imu);
//		ax_offset += imu.accel.x;
//		ay_offset += imu.accel.y;
//		az_offset += imu.accel.z;
//
//		gx_offset += imu.gyro.x;
//		gy_offset += imu.gyro.y;
//		gz_offset += imu.gyro.z;
//	}
//	ax_offset = (ax_offset / 500);
//	ay_offset = (ay_offset / 500);
//	az_offset = (az_offset / 500);
//	gx_offset = (gx_offset / 500);
//	gy_offset = (gy_offset / 500);
//	gz_offset = (gz_offset / 500);

	ax_offset = -0.0187172852;
	ay_offset = -0.0235258788;
	az_offset = 0.98201561;
	gx_offset = 0.497318834;
	gy_offset = -0.169756278;
	gz_offset = 0.151219875;
}
/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {

	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration--------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_TIM3_Init();
	MX_I2C1_Init();
	MX_I2C2_Init();
	MX_SPI1_Init();
	MX_UART4_Init();
	MX_USART1_UART_Init();
	MX_USART2_UART_Init();
	MX_ICACHE_Init();
	MX_UART7_Init();
	MX_SPI2_Init();
	MX_TIM6_Init();
	/* USER CODE BEGIN 2 */
	HAL_TIM_PWM_Init(&htim3);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_3);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_4);

	HAL_TIM_Base_Start_IT(&htim6);

//	HAL_UART_Init(&huart1);
	Serial_Init(&huart1, 115200);
	UART_Command_Init(&huart1);
//	MTF01_Init(&mtf01_handle, &huart2);
	MTF01_Init(&huart2);

	HAL_I2C_Init(&hi2c1);
	HAL_I2C_Init(&hi2c2);
	QMC5883_Init(&hi2c2, &mag, 0x00, 0x01, 0x03, 0x01);

	HAL_SPI_Init(&hspi1);
	HAL_SPI_Init(&hspi2);
	ICM_CS_HIGH();
	NRF_CSN_HIGH();
	HAL_Delay(10);

	NRF24_Init();
	NRF24_OpenReadingPipe(0, address);
	NRF24_StartListening();

//	sprintf(buf, "STATUS=%02X RF_CH=%02X\r\n", status1, ch);
//	HAL_UART_Transmit(&huart1, (uint8_t*) buf, strlen(buf), HAL_MAX_DELAY);
//	Serial_printf(&huart1, "FEATURE=%02X\r\n", NRF24_ReadReg(FEATURE));
//	Serial_printf(&huart1, "DYNPD=%02X\r\n", NRF24_ReadReg(DYNPD));
//	Serial_printf(&huart1, "FIFO=%02X\r\n", NRF24_ReadReg(FIFO_STATUS));
//	Serial_printf(&huart1, "STATUS=%02X\r\n", NRF24_ReadReg(STATUS));
//	Serial_printf(&huart1, "CONFIG=%02X\r\n", NRF24_ReadReg(CONFIG));

	HAL_Delay(500);
	DWT_Init();

	ICM20602_Init();
	mag.declination = 0;

	PID_Init(&PID_Angle, kp_angle, ki_angle, kd_angle, 0.2);
	PID_Init(&PID_Rate_Pitch, kp_p, ki_p, kd_p, 0.2);
	PID_Init(&PID_Rate_Roll, kp_r, ki_r, kd_r, 0.2);
	PID_Init(&PID_Rate_Yaw, kp_y, ki_y, kd_y, 0.2);
	PID_Init(&PID_Alt, kp_alt, ki_alt, kd_alt, 0.2);
	PID_Init(&PID_Alt_Pos, kp_alt_pos, ki_alt_pos, kd_alt_pos, 0.2);
	PID_Init(&PID_Alt_Vel, kp_alt_vel, ki_alt_vel, kd_alt_vel, 0.2);
	PID_Init(&PID_Pos_X, kp_xy_pos, ki_xy_pos, kd_xy_pos, 0.2);
	PID_Init(&PID_Pos_Y, kp_xy_pos, ki_xy_pos, kd_xy_pos, 0.2);
	PID_Init(&PID_Vel_X, kp_xy_vel, ki_xy_vel, kd_xy_vel, 0.2);
	PID_Init(&PID_Vel_Y, kp_xy_vel, ki_xy_vel, kd_xy_vel, 0.2);

	Kalman2D_Init(&kf, 2);
	KalmanAxis_Init(&kf_x);
	KalmanAxis_Init(&kf_y);
//	PosHold_Init(&posHold);

	calibIMU();

	bool yaw_hold_init = false;

	Serial_printf(&huart1, "[WAITING] Waiting pull throttle to 0!\r\n");
	while (1) {
		if (NRF24_Available()) {
			uint8_t len = NRF24_GetDynamicPayloadSize();
			if (len == sizeof(struct ControlData)) {
				NRF24_Read((uint8_t*) &rxData, len);
				if (rxData.chinhtocdoquat == 0)
					break;
			}
		}
	}
	Serial_printf(&huart1, "[OK] START\r\n");
	/* USER CODE END 2 */

	/* Infinite loop */
	/* USER CODE BEGIN WHILE */
	while (1) {
		/* USER CODE END WHILE */

		/* USER CODE BEGIN 3 */
		uint32_t start = DWT_GetMicros();
		uint32_t time_get = HAL_GetTick();
		dt = 0.002f;
		RxController();
		if (!yaw_hold_init && throttle > 1030) {
			target_yaw = yaw;
			// home_position = gpsRead();
			yaw_hold_init = true;
		}
		if (throttle < 1030) {
			yaw_hold_init = false;
			target_yaw = yaw;
			PID_Reset(&PID_Rate_Yaw);
		}
//		if (pid_flag) {		// timer interrupt
//			PID_task();
//			pid_flag = 0;
//		}
		mtf01_updated = MTF01_Update(&mtf_data);
		readIMU();
		calculateAngle(dt);
		Estimate_Position(dt);
		PID_Task(dt);
		mixer();
//		Estimate_Position(dt);

//		Serial_printf(&huart1, "yaw=%.2f ", yaw);
//		Serial_printf(&huart1, "x=%.2f ", est_x);
//		Serial_printf(&huart1, "y=%.2f\r\n", est_y);
//		Serial_printf(&huart1, "tp=%.2f ", target_pitch);
//		Serial_printf(&huart1, "tr=%.2f\r\n", target_roll);
		while ((DWT_GetMicros() - start) < 2000)
			;
//		time_dt = DWT_GetMicros() - start;
//		Serial_printf(&huart1, "dt=%.4f\r\n", time_dt);
//		Serial_printf(&huart1, "yaw=%.1f\r\n", yaw);
	}
	/* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void) {
	RCC_OscInitTypeDef RCC_OscInitStruct = { 0 };
	RCC_ClkInitTypeDef RCC_ClkInitStruct = { 0 };

